In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    337     46   John  January      Q1
1  2023-01-02       B   West    320     15   Mary  January      Q1
2  2023-01-03       C  North    757     88    Bob  January      Q1
3  2023-01-04       D  South    167     18  Alice  January      Q1
4  2023-01-05       A   East    456     71   John  January      Q1
5  2023-01-06       B   West    776     95   Mary  January      Q1
6  2023-01-07       C  North    310     38    Bob  January      Q1
7  2023-01-08       D  South    251     38  Alice  January      Q1
8  2023-01-09       A   East    560     75   John  January      Q1
9  2023-01-10       B   West    946     46   Mary  January      Q1
10 2023-01-11       C  North    212     29    Bob  January      Q1
11 2023-01-12       D  South    237     93  Alice  January      Q1
12 2023-01-13       A   East    104     48   John  January      Q1
13 2023-01-14       B   West    492     20   Mary  January      Q1
14 2023-01-15       C  North    892     79    Bob  January      Q1
15 2023-01-16       D  South    539     25  Alice  January      Q1
16 2023-01-17       A   East    796     56   John  January      Q1
17 2023-01-18       B   West    920     20   Mary  January      Q1
18 2023-01-19       C  North    780     88    Bob  January      Q1
19 2023-01-20       D  South    551     15  Alice  January      Q1

In [4]:
pd.pivot_table(df,values="Sales",index='Region')

        Sales
Region
East    450.6
North   590.2
South   349.0
West    690.8

In [5]:
pd.pivot_table(df,values="Sales",index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     456.0    NaN    NaN    NaN
North      NaN    NaN  757.0    NaN
South      NaN    NaN    NaN  251.0
West       NaN  776.0    NaN    NaN

In [6]:
pivot2 = pd.pivot_table(df,values=["Sales",'Units'],index='Region',columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     450.6    NaN    NaN    NaN  59.2   NaN   NaN   NaN
North      NaN    NaN  590.2    NaN   NaN   NaN  64.4   NaN
South      NaN    NaN    NaN  349.0   NaN   NaN   NaN  37.8
West       NaN  690.8    NaN    NaN   NaN  39.2   NaN   NaN

**Cross Tabs**

In [9]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0